Revit 2027 API
RoutingCondition Constructor
 Creates a new RoutingCondition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoutingCondition(
	double diameter
)
Public Sub New (
	diameter As Double
)
public:
RoutingCondition(
	double diameter
)
new :
        diameter : float -> RoutingCondition
Parameters
diameter Double
 The diameter of a routing segment.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for diameter must be greater than 0 and no more than 30000 feet.
See Also
Reference
RoutingCondition Class
Autodesk.Revit.DB Namespace